#!/usr/bin/env python
# coding: utf-8

# 1. Провести дисперсионный анализ для определения того, есть ли различия среднего роста среди взрослых футболистов, хоккеистов и штангистов.
# Даны значения роста в трех группах случайно выбранных спортсменов:
# Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.

# In[24]:


import numpy as np

foot = np.array([173, 175, 180, 178, 177, 185, 183, 182])
hock = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
weights = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])

all = np.concatenate([foot,hock,weights])


# H0: mu1 = mu2 = mu3
# 
# H1: mu1 != mu2 != mu3
# 
# возьмем а = 0.05

# In[46]:


from scipy import stats
stats.f_oneway(foot, hock, weights)


# pvalue=0.01, 0.01 < 0.05, значит при а = 5% различие среднего роста среди взрослых футболистов, хоккеистов и штангистов статистически значимо 

# Проверим:

# In[25]:


mu1 = np.mean(foot)
mu2 = np.mean(hock)
mu3 = np.mean(weights)
MU = np.mean(all)
print ("mu1 =", mu1)
print ("mu2 =", mu2)
print ("mu3 =", mu3)
print ("MU =", MU)


# In[18]:


n1 = len(foot)
n2 = len(hock)
n3 = len(weights)
N = n1 + n2 + n3
print ("n1 =", n1)
print ("n2 =", n2)
print ("n3 =", n3)
print ("N =", N)


# In[12]:


k = 3


# In[31]:


# сумма квадратов отклонений наблюдений от общего среднего
S = np.sum((all - MU)**2)
S


# In[32]:


# сумма квадратов отклонений средних групповых значений от общего среднего:
S_f = ((mu1 - MU)**2) * n1 + ((mu2 - MU)**2) * n2 + ((mu3 - MU)**2) * n3
S_f


# In[34]:


# остаточная сумма квадратов отклонений:
S_ost = np.sum((foot - mu1)**2) + np.sum((hock - mu2)**2) + np.sum((weights - mu3)**2)
S_ost


# In[35]:


S_f + S_ost


# In[39]:


# факторная дисперсия
sigma_f = S_f / (k - 1)
sigma_f


# In[40]:


# остаточная дисперсия
sigma_ost = S_ost / (N - k)
sigma_ost 


# In[41]:


F_h = sigma_f / sigma_ost
F_h


# In[42]:


k - 1


# In[43]:


N - k


# F_c = 3.38

# F_h > F_c , средний роста зависит от группы. 
